[{"ID":63649,"name":"Williams v. Washington","href":"https://api.oyez.org/cases/2024/23-191","view_count":0,"docket_number":"23-191 ","manner_of_jurisdiction":"Writ of \u003ci\u003ecertiorari\u003c/i\u003e","first_party":"Nancy Williams, et al.","second_party":"Fitzgerald Washington, Alabama Secretary of Labor","timeline":[{"event":"Granted","dates":[1705039200],"href":"https://api.oyez.org/case_timeline/case_timeline/55390"}],"lower_court":{"ID":22,"name":"Supreme Court of Alabama","href":"https://api.oyez.org/taxonomy/term/22"},"facts_of_the_case":"\u003cp\u003eDissatisfied with the Alabama Department of Labor’s handling of their unemployment benefits applications, 26 plaintiffs filed a complaint and motion for injunctive relief against Secretary Fitzgerald Washington and the Department. The plaintiffs, each having filed applications for benefits, alleged various grievances against the Department’s processing methods. Subsequently, Secretary Washington and the Department filed a motion to dismiss the complaint. In response, the plaintiffs amended their complaint, which resulted in the omission of several initial claims and the exclusion of the Department as a defendant.\u003c/p\u003e\n\u003cp\u003eThe remaining allegations in the suit were federal claims under 42 U.S.C. § 1983, accusing Secretary Washington of implementing policies and procedures that violated both the Social Security Act of 1935, 42 U.S.C. § 503(a)(1), and the Due Process Clause of the Fourteenth Amendment. The plaintiffs sought various forms of relief, including multiple permanent and preliminary injunctions to expedite the handling of unemployment compensation applications and improve communication clarity, as well as attorney fees. Secretary Washington again moved to dismiss the case, citing reasons such as lack of subject-matter jurisdiction, absence of a private cause of action, and the substantive meritlessness of the claims. The court granted the dismissal without stating the basis for it. The plaintiffs moved to alter, amend, or vacate the judgment, but the court denied their motion. They then appealed to the Alabama Supreme Court, which affirmed the dismissal, concluding that the lower court lacked jurisdiction over the suit because the plaintiffs had not yet exhausted mandatory administrative remedies.\u003c/p\u003e\n","question":"\u003cp\u003eDoes a Section 1983 claim brought in state court require the plaintiffs to first exhaust state administrative remedies?\u003c/p\u003e\n","citation":{"href":"https://api.oyez.org/case_citation/case_citation/28003"},"first_party_label":"Petitioner","second_party_label":"Respondent","heard_by":[null],"term":"2024","description":"A case in which the Court will decide whether exhaustion of state administrative remedies is required to bring claims under 42 U.S.C. § 1983 in state court.","justia_url":"https://supreme.justia.com/cases/federal/us/2023/23-191 /"},{"ID":63653,"name":"Glossip v. Oklahoma","href":"https://api.oyez.org/cases/2024/22-7466","view_count":0,"docket_number":"22-7466","manner_of_jurisdiction":"Writ of \u003ci\u003ecertiorari\u003c/i\u003e","first_party":"Richard Eugene Glossip","second_party":"Oklahoma","timeline":[{"event":"Granted","dates":[1705903200],"href":"https://api.oyez.org/case_timeline/case_timeline/55398"}],"lower_court":{"ID":58,"name":"Oklahoma Court of Criminal Appeals","href":"https://api.oyez.org/taxonomy/term/58"},"facts_of_the_case":"\u003cp\u003eRichard Glossip was sentenced to death for the 1997 murder of Barry Van Treese, the owner of the Oklahoma City motel where Glossip worked as a manager. Critical to Glossip’s conviction was testimony from Justin Sneed, a handyman at the hotel, who told jurors that Glossip paid him $10,000 to kill Van Treese. After Glossip’s conviction, he received information that Sneed had testified falsely about his mental health and whether he had seen a psychiatrist. Glossip asked the Oklahoma Court of Criminal Appeals to set aside his conviction, but the court rejected that request, and the state’s Pardon and Parole Board turned down Glossip’s request for clemency.\u003c/p\u003e\n\u003cp\u003eAll told, Glossip has spent 26 years behind bars, faced nine execution dates, and had multiple independent investigations that raised serious doubts about his conviction. Ahead of his execution date of May 18, 2023, Glossip asked the Supreme Court to stay his execution and consider whether Oklahoma violated Glossip’s constitutional rights when prosecutors suppressed evidence that their key witness was under a psychiatrist’s care; the Court granted his motion to stay and granted his petition, as well.\u003c/p\u003e\n","question":"\u003cp\u003eMay Oklahoma carry out the execution of Richard Glossip in light of the prosecutorial misconduct and other errors that affected his conviction and sentencing?\u003c/p\u003e\n","citation":{"href":"https://api.oyez.org/case_citation/case_citation/28006"},"first_party_label":"Petitioner","second_party_label":"Respondent","heard_by":[null],"term":"2024","description":"A capital case in which the Court will decide whether to allow Oklahoma to execute Petitioner Richard Glossip after numerous instances of prosecutorial misconduct and other errors, where even the state no longer defends the capital sentence.","justia_url":"https://supreme.justia.com/cases/federal/us/2024/22-7466/"}]